//写一个函数，求两个整数之和，要求在函数体内不得使用+、-、*、/四则运算符号。
//改成二进制运算
/**
    ^   异或运算符      只有在两个比较的位不同时其结果是1，否则结果为0    0101 ^ 1011 = 1110
    &   与运算符        只有前后两个运算数都是 1 的时候结果才是1        0101 & 1011 = 0001
    <<  左移运算符      3 << 2   3(0000 0000 0000 0000 0000 0000 0000 0011)  --->(0000 0000 0000 0000 0000 0000 0000 1100)
    >>  右移运算符      11 >> 2  11(0000 0000 0000 0000 0000 0000 0000 1011) --->(0000 0000 0000 0000 0000 0000 0000 0010)
 */
//
function Add(num1, num2)
{
    var sum;
    var temp;
    do{
        sum = num1^num2;
        temp  = (num1&num2)<<1;
        num1 = sum;
        num2 = temp;
    }while(num2!=0)
    console.log(sum);
}
Add(2,0);